; ModuleID = 'BitcodeBuffer'
source_filename = "zig-playground"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128-Fn32"
target triple = "aarch64-apple-macosx15.1.1-unknown"

%macho.mach_header_64 = type { i32, i32, i32, i32, i32, i32, i32, i32 }

@os.argv = internal unnamed_addr global { ptr, i64 } undef, align 8, !dbg !0
@os.environ = internal unnamed_addr global { ptr, i64 } undef, align 8, !dbg !644
@__anon_2409 = internal unnamed_addr constant { { ptr }, i32, i32 } { { ptr } { ptr @start.noopSigHandler }, i32 0, i32 0 }, align 8
@_mh_execute_header = weak_odr dso_local local_unnamed_addr global %macho.mach_header_64 undef, align 4, !dbg !683

; Function Attrs: nosanitize_coverage nounwind skipprofile uwtable
define dso_local noundef i32 @main(i32 %0, ptr nonnull align 8 %1, ptr nonnull align 8 %2) local_unnamed_addr #0 !dbg !704 {
Entry:
    #dbg_value(i32 %0, !711, !DIExpression(), !712)
    #dbg_value(ptr %1, !713, !DIExpression(), !712)
    #dbg_value(ptr %2, !714, !DIExpression(), !712)
    #dbg_value(i64 0, !715, !DIExpression(), !716)
  br label %Loop, !dbg !717

Loop:                                             ; preds = %Loop, %Entry
  %.sroa.0.0 = phi i64 [ 0, %Entry ], [ %5, %Loop ], !dbg !716
    #dbg_value(i64 %.sroa.0.0, !715, !DIExpression(), !716)
  %3 = getelementptr inbounds ptr, ptr %2, i64 %.sroa.0.0, !dbg !719
  %4 = load ptr, ptr %3, align 8, !dbg !719
  %.not = icmp eq ptr %4, null, !dbg !719
  %5 = add nuw i64 %.sroa.0.0, 1, !dbg !722

!72 = !DIEnumerator(name: "CONNREFUSED", value: 61, isUnsigned: true)
!73 = !DIEnumerator(name: "LOOP", value: 62, isUnsigned: true)
!74 = !DIEnumerator(name: "NAMETOOLONG", value: 63, isUnsigned: true)
!75 = !DIEnumerator(name: "HOSTDOWN", value: 64, isUnsigned: true)
!76 = !DIEnumerator(name: "HOSTUNREACH", value: 65, isUnsigned: true)
!77 = !DIEnumerator(name: "NOTEMPTY", value: 66, isUnsigned: true)
!78 = !DIEnumerator(name: "PROCLIM", value: 67, isUnsigned: true)
!79 = !DIEnumerator(name: "USERS", value: 68, isUnsigned: true)
!80 = !DIEnumerator(name: "DQUOT", value: 69, isUnsigned: true)
!81 = !DIEnumerator(name: "STALE", value: 70, isUnsigned: true)
!82 = !DIEnumerator(name: "REMOTE", value: 71, isUnsigned: true)
!83 = !DIEnumerator(name: "BADRPC", value: 72, isUnsigned: true)
!84 = !DIEnumerator(name: "RPCMISMATCH", value: 73, isUnsigned: true)
!85 = !DIEnumerator(name: "PROGUNAVAIL", value: 74, isUnsigned: true)
!86 = !DIEnumerator(name: "PROGMISMATCH", value: 75, isUnsigned: true)
!87 = !DIEnumerator(name: "PROCUNAVAIL", value: 76, isUnsigned: true)
!88 = !DIEnumerator(name: "NOLCK", value: 77, isUnsigned: true)
!89 = !DIEnumerator(name: "NOSYS", value: 78, isUnsigned: true)
!90 = !DIEnumerator(name: "FTYPE", value: 79, isUnsigned: true)
!91 = !DIEnumerator(name: "AUTH", value: 80, isUnsigned: true)
!92 = !DIEnumerator(name: "NEEDAUTH", value: 81, isUnsigned: true)
!93 = !DIEnumerator(name: "PWROFF", value: 82, isUnsigned: true)
!94 = !DIEnumerator(name: "DEVERR", value: 83, isUnsigned: true)
!95 = !DIEnumerator(name: "OVERFLOW", value: 84, isUnsigned: true)
!96 = !DIEnumerator(name: "BADEXEC", value: 85, isUnsigned: true)
!97 = !DIEnumerator(name: "BADARCH", value: 86, isUnsigned: true)
!98 = !DIEnumerator(name: "SHLIBVERS", value: 87, isUnsigned: true)
!99 = !DIEnumerator(name: "BADMACHO", value: 88, isUnsigned: true)
!100 = !DIEnumerator(name: "CANCELED", value: 89, isUnsigned: true)
!101 = !DIEnumerator(name: "IDRM", value: 90, isUnsigned: true)
!102 = !DIEnumerator(name: "NOMSG", value: 91, isUnsigned: true)
!103 = !DIEnumerator(name: "ILSEQ", value: 92, isUnsigned: true)
!104 = !DIEnumerator(name: "NOATTR", value: 93, isUnsigned: true)
!105 = !DIEnumerator(name: "BADMSG", value: 94, isUnsigned: true)
!106 = !DIEnumerator(name: "MULTIHOP", value: 95, isUnsigned: true)
!107 = !DIEnumerator(name: "NODATA", value: 96, isUnsigned: true)
!108 = !DIEnumerator(name: "NOLINK", value: 97, isUnsigned: true)
!109 = !DIEnumerator(name: "NOSR", value: 98, isUnsigned: true)
!110 = !DIEnumerator(name: "NOSTR", value: 99, isUnsigned: true)
!111 = !DIEnumerator(name: "PROTO", value: 100, isUnsigned: true)
!112 = !DIEnumerator(name: "TIME", value: 101, isUnsigned: true)
!113 = !DIEnumerator(name: "NOPOLICY", value: 103, isUnsigned: true)
!114 = !DIEnumerator(name: "NOTRECOVERABLE", value: 104, isUnsigned: true)
!115 = !DIEnumerator(name: "OWNERDEAD", value: 105, isUnsigned: true)
!116 = !DIEnumerator(name: "QFULL", value: 106, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CompilerBackend", scope: !118, file: !118, line: 1013, baseType: !119, size: 64, align: 64, elements: !120)
!118 = !DIFile(filename: "builtin.zig", directory: "/Users/juliaortiz/zig/lib/std")
!119 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!121 = !DIEnumerator(name: "other", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "stage1", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "stage2_llvm", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "stage2_c", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "stage2_wasm", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "stage2_arm", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "stage2_x86_64", value: 6, isUnsigned: true)
!128 = !DIEnumerator(name: "stage2_aarch64", value: 7, isUnsigned: true)
!129 = !DIEnumerator(name: "stage2_x86", value: 8, isUnsigned: true)
!130 = !DIEnumerator(name: "stage2_riscv64", value: 9, isUnsigned: true)
!131 = !DIEnumerator(name: "stage2_sparc64", value: 10, isUnsigned: true)
!132 = !DIEnumerator(name: "stage2_spirv64", value: 11, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.OutputMode", scope: !118, file: !118, line: 793, baseType: !134, size: 8, align: 8, elements: !135)
!134 = !DIBasicType(name: "u2", size: 8, encoding: DW_ATE_unsigned)
!135 = !{!136, !137, !138}
!136 = !DIEnumerator(name: "Exe", value: 0, isUnsigned: true)
!137 = !DIEnumerator(name: "Lib", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "Obj", value: 2, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Cpu.Arch", scope: !141, file: !140, line: 1863, baseType: !165, size: 8, align: 8, elements: !166)
!140 = !DIFile(filename: "Target.zig", directory: "/Users/juliaortiz/zig/lib/std")
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu", scope: !4, size: 448, align: 64, elements: !142)
!142 = !{!143, !163, !164}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "model", scope: !141, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*Target.Cpu.Model", baseType: !145, size: 64, align: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu.Model", scope: !4, size: 576, align: 64, elements: !146)
!146 = !{!147, !155, !156}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !145, baseType: !148, size: 128, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "[]u8", scope: !4, size: 128, align: 64, elements: !149)
!149 = !{!150, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !148, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*u8", baseType: !152, size: 64, align: 8)
!152 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !148, baseType: !154, size: 64, align: 64, offset: 64)
!154 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "llvm_name", scope: !145, baseType: !148, size: 128, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !145, baseType: !157, size: 320, align: 64, offset: 256)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Cpu.Feature.Set", scope: !4, size: 320, align: 64, elements: !158)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ints", scope: !157, baseType: !160, size: 320, align: 64)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 320, align: 64, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 5, lowerBound: -424)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "features", scope: !141, baseType: !157, size: 320, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !141, baseType: !139, size: 8, align: 8, offset: 384)
!165 = !DIBasicType(name: "u6", size: 8, encoding: DW_ATE_unsigned)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!167 = !DIEnumerator(name: "amdgcn", value: 0, isUnsigned: true)
!168 = !DIEnumerator(name: "arc", value: 1, isUnsigned: true)
!169 = !DIEnumerator(name: "arm", value: 2, isUnsigned: true)
!170 = !DIEnumerator(name: "armeb", value: 3, isUnsigned: true)
!171 = !DIEnumerator(name: "thumb", value: 4, isUnsigned: true)
!172 = !DIEnumerator(name: "thumbeb", value: 5, isUnsigned: true)
!173 = !DIEnumerator(name: "aarch64", value: 6, isUnsigned: true)
!174 = !DIEnumerator(name: "aarch64_be", value: 7, isUnsigned: true)
!175 = !DIEnumerator(name: "avr", value: 8, isUnsigned: true)
!176 = !DIEnumerator(name: "bpfel", value: 9, isUnsigned: true)
!177 = !DIEnumerator(name: "bpfeb", value: 10, isUnsigned: true)
!178 = !DIEnumerator(name: "csky", value: 11, isUnsigned: true)
!179 = !DIEnumerator(name: "hexagon", value: 12, isUnsigned: true)
!180 = !DIEnumerator(name: "kalimba", value: 13, isUnsigned: true)
!181 = !DIEnumerator(name: "lanai", value: 14, isUnsigned: true)
!182 = !DIEnumerator(name: "loongarch32", value: 15, isUnsigned: true)
!183 = !DIEnumerator(name: "loongarch64", value: 16, isUnsigned: true)
!184 = !DIEnumerator(name: "m68k", value: 17, isUnsigned: true)
!185 = !DIEnumerator(name: "mips", value: 18, isUnsigned: true)
!186 = !DIEnumerator(name: "mipsel", value: 19, isUnsigned: true)
!187 = !DIEnumerator(name: "mips64", value: 20, isUnsigned: true)
!188 = !DIEnumerator(name: "mips64el", value: 21, isUnsigned: true)
!189 = !DIEnumerator(name: "msp430", value: 22, isUnsigned: true)
!190 = !DIEnumerator(name: "nvptx", value: 23, isUnsigned: true)
!191 = !DIEnumerator(name: "nvptx64", value: 24, isUnsigned: true)
!192 = !DIEnumerator(name: "powerpc", value: 25, isUnsigned: true)
!193 = !DIEnumerator(name: "powerpcle", value: 26, isUnsigned: true)
!194 = !DIEnumerator(name: "powerpc64", value: 27, isUnsigned: true)
!195 = !DIEnumerator(name: "powerpc64le", value: 28, isUnsigned: true)
!196 = !DIEnumerator(name: "propeller1", value: 29, isUnsigned: true)
!197 = !DIEnumerator(name: "propeller2", value: 30, isUnsigned: true)
!198 = !DIEnumerator(name: "riscv32", value: 31, isUnsigned: true)
!199 = !DIEnumerator(name: "riscv64", value: 32, isUnsigned: true)
!200 = !DIEnumerator(name: "s390x", value: 33, isUnsigned: true)
!201 = !DIEnumerator(name: "sparc", value: 34, isUnsigned: true)
!202 = !DIEnumerator(name: "sparc64", value: 35, isUnsigned: true)
!203 = !DIEnumerator(name: "spirv", value: 36, isUnsigned: true)
!204 = !DIEnumerator(name: "spirv32", value: 37, isUnsigned: true)
!205 = !DIEnumerator(name: "spirv64", value: 38, isUnsigned: true)
!206 = !DIEnumerator(name: "spu_2", value: 39, isUnsigned: true)
!207 = !DIEnumerator(name: "ve", value: 40, isUnsigned: true)
!208 = !DIEnumerator(name: "wasm32", value: 41, isUnsigned: true)
!209 = !DIEnumerator(name: "wasm64", value: 42, isUnsigned: true)
!210 = !DIEnumerator(name: "x86", value: 43, isUnsigned: true)
!211 = !DIEnumerator(name: "x86_64", value: 44, isUnsigned: true)
!212 = !DIEnumerator(name: "xcore", value: 45, isUnsigned: true)
!213 = !DIEnumerator(name: "xtensa", value: 46, isUnsigned: true)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Os.WindowsVersion", scope: !215, file: !140, line: 356, baseType: !238, size: 32, align: 32, elements: !289)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os", scope: !4, size: 1472, align: 64, elements: !216)
!216 = !{!217, !244}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "version_range", scope: !215, baseType: !218, size: 1408, align: 64)
!218 = !DICompositeType(tag: DW_TAG_union_type, name: "Target.Os.VersionRange", scope: !4, size: 1408, align: 64, elements: !219)
!219 = !{!220, !232, !239}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "semver", scope: !218, baseType: !221, size: 896, align: 64)
!221 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemanticVersion.Range", scope: !4, size: 896, align: 64, elements: !222)
!222 = !{!223, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !221, baseType: !224, size: 448, align: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemanticVersion", scope: !4, size: 448, align: 64, elements: !225)
!225 = !{!226, !227, !228, !229, !230}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !224, baseType: !154, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !224, baseType: !154, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "patch", scope: !224, baseType: !154, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pre", scope: !224, baseType: !148, size: 128, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !224, baseType: !148, size: 128, align: 64, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !221, baseType: !224, size: 448, align: 64, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "linux", scope: !218, baseType: !233, size: 1408, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.LinuxVersionRange", scope: !4, size: 1408, align: 64, elements: !234)
!234 = !{!235, !236, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !233, baseType: !221, size: 896, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "glibc", scope: !233, baseType: !224, size: 448, align: 64, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "android", scope: !233, baseType: !238, size: 32, align: 32, offset: 1344)
!238 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "windows", scope: !218, baseType: !240, size: 64, align: 32)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.Os.WindowsVersion.Range", scope: !4, size: 64, align: 32, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !240, baseType: !214, size: 32, align: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !240, baseType: !214, size: 32, align: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !215, baseType: !245, size: 8, align: 8, offset: 1408)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Os.Tag", scope: !215, file: !140, line: 242, baseType: !165, size: 8, align: 8, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!247 = !DIEnumerator(name: "freestanding", value: 0, isUnsigned: true)
!248 = !DIEnumerator(name: "other", value: 1, isUnsigned: true)
!249 = !DIEnumerator(name: "contiki", value: 2, isUnsigned: true)
!250 = !DIEnumerator(name: "elfiamcu", value: 3, isUnsigned: true)
!251 = !DIEnumerator(name: "fuchsia", value: 4, isUnsigned: true)
!252 = !DIEnumerator(name: "hermit", value: 5, isUnsigned: true)
!253 = !DIEnumerator(name: "aix", value: 6, isUnsigned: true)
!254 = !DIEnumerator(name: "haiku", value: 7, isUnsigned: true)
!255 = !DIEnumerator(name: "hurd", value: 8, isUnsigned: true)
!256 = !DIEnumerator(name: "linux", value: 9, isUnsigned: true)
!257 = !DIEnumerator(name: "plan9", value: 10, isUnsigned: true)
!258 = !DIEnumerator(name: "rtems", value: 11, isUnsigned: true)
!259 = !DIEnumerator(name: "serenity", value: 12, isUnsigned: true)
!260 = !DIEnumerator(name: "zos", value: 13, isUnsigned: true)
!261 = !DIEnumerator(name: "dragonfly", value: 14, isUnsigned: true)
!262 = !DIEnumerator(name: "freebsd", value: 15, isUnsigned: true)
!263 = !DIEnumerator(name: "netbsd", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "openbsd", value: 17, isUnsigned: true)
!265 = !DIEnumerator(name: "bridgeos", value: 18, isUnsigned: true)
!266 = !DIEnumerator(name: "driverkit", value: 19, isUnsigned: true)
!267 = !DIEnumerator(name: "ios", value: 20, isUnsigned: true)
!268 = !DIEnumerator(name: "macos", value: 21, isUnsigned: true)
!269 = !DIEnumerator(name: "tvos", value: 22, isUnsigned: true)
!270 = !DIEnumerator(name: "visionos", value: 23, isUnsigned: true)
!271 = !DIEnumerator(name: "watchos", value: 24, isUnsigned: true)
!272 = !DIEnumerator(name: "illumos", value: 25, isUnsigned: true)
!273 = !DIEnumerator(name: "solaris", value: 26, isUnsigned: true)
!274 = !DIEnumerator(name: "windows", value: 27, isUnsigned: true)
!275 = !DIEnumerator(name: "uefi", value: 28, isUnsigned: true)
!276 = !DIEnumerator(name: "ps3", value: 29, isUnsigned: true)
!277 = !DIEnumerator(name: "ps4", value: 30, isUnsigned: true)
!278 = !DIEnumerator(name: "ps5", value: 31, isUnsigned: true)
!279 = !DIEnumerator(name: "emscripten", value: 32, isUnsigned: true)
!280 = !DIEnumerator(name: "wasi", value: 33, isUnsigned: true)
!281 = !DIEnumerator(name: "amdhsa", value: 34, isUnsigned: true)
!282 = !DIEnumerator(name: "amdpal", value: 35, isUnsigned: true)
!283 = !DIEnumerator(name: "cuda", value: 36, isUnsigned: true)
!284 = !DIEnumerator(name: "mesa3d", value: 37, isUnsigned: true)
!285 = !DIEnumerator(name: "nvcl", value: 38, isUnsigned: true)
!286 = !DIEnumerator(name: "opencl", value: 39, isUnsigned: true)
!287 = !DIEnumerator(name: "opengl", value: 40, isUnsigned: true)
!288 = !DIEnumerator(name: "vulkan", value: 41, isUnsigned: true)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!290 = !DIEnumerator(name: "nt4", value: 67108864, isUnsigned: true)
!291 = !DIEnumerator(name: "win2k", value: 83886080, isUnsigned: true)
!292 = !DIEnumerator(name: "xp", value: 83951616, isUnsigned: true)
!293 = !DIEnumerator(name: "ws2003", value: 84017152, isUnsigned: true)
!294 = !DIEnumerator(name: "vista", value: 100663296, isUnsigned: true)
!295 = !DIEnumerator(name: "win7", value: 100728832, isUnsigned: true)
!296 = !DIEnumerator(name: "win8", value: 100794368, isUnsigned: true)
!297 = !DIEnumerator(name: "win8_1", value: 100859904, isUnsigned: true)
!298 = !DIEnumerator(name: "win10", value: 167772160, isUnsigned: true)
!299 = !DIEnumerator(name: "win10_th2", value: 167772161, isUnsigned: true)
!300 = !DIEnumerator(name: "win10_rs1", value: 167772162, isUnsigned: true)
!301 = !DIEnumerator(name: "win10_rs2", value: 167772163, isUnsigned: true)
!302 = !DIEnumerator(name: "win10_rs3", value: 167772164, isUnsigned: true)
!303 = !DIEnumerator(name: "win10_rs4", value: 167772165, isUnsigned: true)
!304 = !DIEnumerator(name: "win10_rs5", value: 167772166, isUnsigned: true)
!305 = !DIEnumerator(name: "win10_19h1", value: 167772167, isUnsigned: true)
!306 = !DIEnumerator(name: "win10_vb", value: 167772168, isUnsigned: true)
!307 = !DIEnumerator(name: "win10_mn", value: 167772169, isUnsigned: true)
!308 = !DIEnumerator(name: "win10_fe", value: 167772170, isUnsigned: true)
!309 = !DIEnumerator(name: "win10_co", value: 167772171, isUnsigned: true)
!310 = !DIEnumerator(name: "win10_ni", value: 167772172, isUnsigned: true)
!311 = !DIEnumerator(name: "win10_cu", value: 167772173, isUnsigned: true)
!312 = !DIEnumerator(name: "win11_zn", value: 167772174, isUnsigned: true)
!313 = !DIEnumerator(name: "win11_ga", value: 167772175, isUnsigned: true)
!314 = !DIEnumerator(name: "win11_ge", value: 167772176, isUnsigned: true)
!315 = !DIEnumerator(name: "win11_dt", value: 167772177, isUnsigned: true)
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.Abi", scope: !140, file: !140, line: 971, baseType: !317, size: 8, align: 8, elements: !318)
!317 = !DIBasicType(name: "u5", size: 8, encoding: DW_ATE_unsigned)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!319 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!320 = !DIEnumerator(name: "gnu", value: 1, isUnsigned: true)
!321 = !DIEnumerator(name: "gnuabin32", value: 2, isUnsigned: true)
!322 = !DIEnumerator(name: "gnuabi64", value: 3, isUnsigned: true)
!323 = !DIEnumerator(name: "gnueabi", value: 4, isUnsigned: true)
!324 = !DIEnumerator(name: "gnueabihf", value: 5, isUnsigned: true)
!325 = !DIEnumerator(name: "gnuf32", value: 6, isUnsigned: true)
!326 = !DIEnumerator(name: "gnusf", value: 7, isUnsigned: true)
!327 = !DIEnumerator(name: "gnux32", value: 8, isUnsigned: true)
!328 = !DIEnumerator(name: "gnuilp32", value: 9, isUnsigned: true)
!329 = !DIEnumerator(name: "code16", value: 10, isUnsigned: true)
!330 = !DIEnumerator(name: "eabi", value: 11, isUnsigned: true)
!331 = !DIEnumerator(name: "eabihf", value: 12, isUnsigned: true)
!332 = !DIEnumerator(name: "ilp32", value: 13, isUnsigned: true)
!333 = !DIEnumerator(name: "android", value: 14, isUnsigned: true)
!334 = !DIEnumerator(name: "androideabi", value: 15, isUnsigned: true)
!335 = !DIEnumerator(name: "musl", value: 16, isUnsigned: true)
!336 = !DIEnumerator(name: "muslabin32", value: 17, isUnsigned: true)
!337 = !DIEnumerator(name: "muslabi64", value: 18, isUnsigned: true)
!338 = !DIEnumerator(name: "musleabi", value: 19, isUnsigned: true)
!339 = !DIEnumerator(name: "musleabihf", value: 20, isUnsigned: true)
!340 = !DIEnumerator(name: "muslx32", value: 21, isUnsigned: true)
!341 = !DIEnumerator(name: "msvc", value: 22, isUnsigned: true)
!342 = !DIEnumerator(name: "itanium", value: 23, isUnsigned: true)
!343 = !DIEnumerator(name: "cygnus", value: 24, isUnsigned: true)
!344 = !DIEnumerator(name: "simulator", value: 25, isUnsigned: true)
!345 = !DIEnumerator(name: "macabi", value: 26, isUnsigned: true)
!346 = !DIEnumerator(name: "ohos", value: 27, isUnsigned: true)
!347 = !DIEnumerator(name: "ohoseabi", value: 28, isUnsigned: true)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Target.ObjectFormat", scope: !140, file: !140, line: 1030, baseType: !349, size: 8, align: 8, elements: !350)
!349 = !DIBasicType(name: "u4", size: 8, encoding: DW_ATE_unsigned)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362}
!351 = !DIEnumerator(name: "c", value: 0, isUnsigned: true)
!352 = !DIEnumerator(name: "coff", value: 1, isUnsigned: true)
!353 = !DIEnumerator(name: "elf", value: 2, isUnsigned: true)
!354 = !DIEnumerator(name: "goff", value: 3, isUnsigned: true)
!355 = !DIEnumerator(name: "hex", value: 4, isUnsigned: true)
!356 = !DIEnumerator(name: "macho", value: 5, isUnsigned: true)
!357 = !DIEnumerator(name: "nvptx", value: 6, isUnsigned: true)
!358 = !DIEnumerator(name: "plan9", value: 7, isUnsigned: true)
!359 = !DIEnumerator(name: "raw", value: 8, isUnsigned: true)
!360 = !DIEnumerator(name: "spirv", value: 9, isUnsigned: true)
!361 = !DIEnumerator(name: "wasm", value: 10, isUnsigned: true)
!362 = !DIEnumerator(name: "xcoff", value: 11, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.ArmInterruptOptions.InterruptType", scope: !364, file: !118, line: 436, baseType: !372, size: 8, align: 8, elements: !373)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.ArmInterruptOptions", scope: !4, size: 192, align: 64, elements: !365)
!365 = !{!366, !371}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !364, baseType: !367, size: 128, align: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "?u64", scope: !4, size: 128, align: 64, elements: !368)
!368 = !{!369, !370}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, baseType: !119, size: 64, align: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "some", scope: !367, baseType: !152, size: 8, align: 8, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, baseType: !363, size: 8, align: 8, offset: 128)
!372 = !DIBasicType(name: "u3", size: 8, encoding: DW_ATE_unsigned)
!373 = !{!374, !375, !376, !377, !378, !379}
!374 = !DIEnumerator(name: "generic", value: 0, isUnsigned: true)
!375 = !DIEnumerator(name: "irq", value: 1, isUnsigned: true)
!376 = !DIEnumerator(name: "fiq", value: 2, isUnsigned: true)
!377 = !DIEnumerator(name: "swi", value: 3, isUnsigned: true)
!378 = !DIEnumerator(name: "abort", value: 4, isUnsigned: true)
!379 = !DIEnumerator(name: "undef", value: 5, isUnsigned: true)
!380 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.MipsInterruptOptions.InterruptMode", scope: !381, file: !118, line: 454, baseType: !349, size: 8, align: 8, elements: !385)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.MipsInterruptOptions", scope: !4, size: 192, align: 64, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !381, baseType: !367, size: 128, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !381, baseType: !380, size: 8, align: 8, offset: 128)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394}
!386 = !DIEnumerator(name: "eic", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "sw0", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "sw1", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "hw0", value: 3, isUnsigned: true)
!390 = !DIEnumerator(name: "hw1", value: 4, isUnsigned: true)
!391 = !DIEnumerator(name: "hw2", value: 5, isUnsigned: true)
!392 = !DIEnumerator(name: "hw3", value: 6, isUnsigned: true)
!393 = !DIEnumerator(name: "hw4", value: 7, isUnsigned: true)
!394 = !DIEnumerator(name: "hw5", value: 8, isUnsigned: true)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.CallingConvention.RiscvInterruptOptions.PrivilegeMode", scope: !396, file: !118, line: 475, baseType: !134, size: 8, align: 8, elements: !400)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.RiscvInterruptOptions", scope: !4, size: 192, align: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !396, baseType: !367, size: 128, align: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !396, baseType: !395, size: 8, align: 8, offset: 128)
!400 = !{!401, !402}
!401 = !DIEnumerator(name: "supervisor", value: 0, isUnsigned: true)
!402 = !DIEnumerator(name: "machine", value: 1, isUnsigned: true)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "@typeInfo(builtin.CallingConvention).@\22union\22.tag_type.?", scope: !404, file: !118, line: 496, baseType: !152, size: 8, align: 8, elements: !489)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention", scope: !4, size: 256, align: 64, elements: !405)
!405 = !{!406, !488}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !404, baseType: !407, size: 192, align: 64)
!407 = !DICompositeType(tag: DW_TAG_union_type, name: "builtin.CallingConvention:Payload", scope: !4, size: 256, align: 64, elements: !408)
!408 = !{!409, !413, !414, !415, !416, !417, !418, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.CommonOptions", scope: !4, size: 128, align: 64, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !410, baseType: !367, size: 128, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_win", scope: !407, baseType: !410, size: 128, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_regcall_v3_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_regcall_v4_win", scope: !407, baseType: !410, size: 128, align: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_vectorcall", scope: !407, baseType: !410, size: 128, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "x86_64_interrupt", scope: !407, baseType: !410, size: 128, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "x86_sysv", scope: !407, baseType: !419, size: 192, align: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "builtin.CallingConvention.X86RegparmOptions", scope: !4, size: 192, align: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_stack_alignment", scope: !419, baseType: !367, size: 128, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "register_params", scope: !419, baseType: !134, size: 8, align: 8, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "x86_win", scope: !407, baseType: !419, size: 192, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "x86_stdcall", scope: !407, baseType: !419, size: 192, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "x86_fastcall", scope: !407, baseType: !410, size: 128, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "x86_thiscall", scope: !407, baseType: !410, size: 128, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "x86_thiscall_mingw", scope: !407, baseType: !410, size: 128, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "x86_regcall_v3", scope: !407, baseType: !410, size: 128, align: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "x86_regcall_v4_win", scope: !407, baseType: !410, size: 128, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "x86_vectorcall", scope: !407, baseType: !410, size: 128, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "x86_interrupt", scope: !407, baseType: !410, size: 128, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs", scope: !407, baseType: !410, size: 128, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs_darwin", scope: !407, baseType: !410, size: 128, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_aapcs_win", scope: !407, baseType: !410, size: 128, align: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_vfabi", scope: !407, baseType: !410, size: 128, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "aarch64_vfabi_sve", scope: !407, baseType: !410, size: 128, align: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "arm_apcs", scope: !407, baseType: !410, size: 128, align: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "arm_aapcs", scope: !407, baseType: !410, size: 128, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "arm_aapcs_vfp", scope: !407, baseType: !410, size: 128, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "arm_aapcs16_vfp", scope: !407, baseType: !410, size: 128, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "arm_interrupt", scope: !407, baseType: !364, size: 192, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_n64", scope: !407, baseType: !410, size: 128, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_n32", scope: !407, baseType: !410, size: 128, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "mips64_interrupt", scope: !407, baseType: !381, size: 192, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mips_o32", scope: !407, baseType: !410, size: 128, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mips_interrupt", scope: !407, baseType: !381, size: 192, align: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_lp64", scope: !407, baseType: !410, size: 128, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_lp64_v", scope: !407, baseType: !410, size: 128, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "riscv64_interrupt", scope: !407, baseType: !396, size: 192, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_ilp32", scope: !407, baseType: !410, size: 128, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_ilp32_v", scope: !407, baseType: !410, size: 128, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "riscv32_interrupt", scope: !407, baseType: !396, size: 192, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sparc64_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sparc_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf", scope: !407, baseType: !410, size: 128, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf_altivec", scope: !407, baseType: !410, size: 128, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc64_elf_v2", scope: !407, baseType: !410, size: 128, align: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_sysv_altivec", scope: !407, baseType: !410, size: 128, align: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_aix", scope: !407, baseType: !410, size: 128, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "powerpc_aix_altivec", scope: !407, baseType: !410, size: 128, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "wasm_watc", scope: !407, baseType: !410, size: 128, align: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "arc_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_std", scope: !407, baseType: !410, size: 128, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "csky_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "csky_interrupt", scope: !407, baseType: !410, size: 128, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hexagon_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "hexagon_sysv_hvx", scope: !407, baseType: !410, size: 128, align: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "lanai_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "loongarch64_lp64", scope: !407, baseType: !410, size: 128, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "loongarch32_ilp32", scope: !407, baseType: !410, size: 128, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_gnu", scope: !407, baseType: !410, size: 128, align: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_rtd", scope: !407, baseType: !410, size: 128, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "m68k_interrupt", scope: !407, baseType: !410, size: 128, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "msp430_eabi", scope: !407, baseType: !410, size: 128, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "propeller1_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "propeller2_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "s390x_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "s390x_sysv_vx", scope: !407, baseType: !410, size: 128, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ve_sysv", scope: !407, baseType: !410, size: 128, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "xcore_xs1", scope: !407, baseType: !410, size: 128, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "xcore_xs2", scope: !407, baseType: !410, size: 128, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "xtensa_call0", scope: !407, baseType: !410, size: 128, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "xtensa_windowed", scope: !407, baseType: !410, size: 128, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "amdgcn_device", scope: !407, baseType: !410, size: 128, align: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "amdgcn_cs", scope: !407, baseType: !410, size: 128, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !404, baseType: !403, size: 8, align: 8, offset: 192)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!490 = !DIEnumerator(name: "auto", value: 0, isUnsigned: true)
!491 = !DIEnumerator(name: "async", value: 1, isUnsigned: true)
!492 = !DIEnumerator(name: "naked", value: 2, isUnsigned: true)
!493 = !DIEnumerator(name: "inline", value: 3, isUnsigned: true)
!494 = !DIEnumerator(name: "x86_64_sysv", value: 4, isUnsigned: true)
!495 = !DIEnumerator(name: "x86_64_win", value: 5, isUnsigned: true)
!496 = !DIEnumerator(name: "x86_64_regcall_v3_sysv", value: 6, isUnsigned: true)
!497 = !DIEnumerator(name: "x86_64_regcall_v4_win", value: 7, isUnsigned: true)
!498 = !DIEnumerator(name: "x86_64_vectorcall", value: 8, isUnsigned: true)
!499 = !DIEnumerator(name: "x86_64_interrupt", value: 9, isUnsigned: true)
!500 = !DIEnumerator(name: "x86_sysv", value: 10, isUnsigned: true)
!501 = !DIEnumerator(name: "x86_win", value: 11, isUnsigned: true)
!502 = !DIEnumerator(name: "x86_stdcall", value: 12, isUnsigned: true)
!503 = !DIEnumerator(name: "x86_fastcall", value: 13, isUnsigned: true)
!504 = !DIEnumerator(name: "x86_thiscall", value: 14, isUnsigned: true)
!505 = !DIEnumerator(name: "x86_thiscall_mingw", value: 15, isUnsigned: true)
!506 = !DIEnumerator(name: "x86_regcall_v3", value: 16, isUnsigned: true)
!507 = !DIEnumerator(name: "x86_regcall_v4_win", value: 17, isUnsigned: true)
!508 = !DIEnumerator(name: "x86_vectorcall", value: 18, isUnsigned: true)
!509 = !DIEnumerator(name: "x86_interrupt", value: 19, isUnsigned: true)
!510 = !DIEnumerator(name: "aarch64_aapcs", value: 20, isUnsigned: true)
!511 = !DIEnumerator(name: "aarch64_aapcs_darwin", value: 21, isUnsigned: true)
!512 = !DIEnumerator(name: "aarch64_aapcs_win", value: 22, isUnsigned: true)
!513 = !DIEnumerator(name: "aarch64_vfabi", value: 23, isUnsigned: true)
!514 = !DIEnumerator(name: "aarch64_vfabi_sve", value: 24, isUnsigned: true)
!515 = !DIEnumerator(name: "arm_apcs", value: 25, isUnsigned: true)
!516 = !DIEnumerator(name: "arm_aapcs", value: 26, isUnsigned: true)
!517 = !DIEnumerator(name: "arm_aapcs_vfp", value: 27, isUnsigned: true)
!518 = !DIEnumerator(name: "arm_aapcs16_vfp", value: 28, isUnsigned: true)
!519 = !DIEnumerator(name: "arm_interrupt", value: 29, isUnsigned: true)
!520 = !DIEnumerator(name: "mips64_n64", value: 30, isUnsigned: true)
!521 = !DIEnumerator(name: "mips64_n32", value: 31, isUnsigned: true)
!522 = !DIEnumerator(name: "mips64_interrupt", value: 32, isUnsigned: true)
!523 = !DIEnumerator(name: "mips_o32", value: 33, isUnsigned: true)
!524 = !DIEnumerator(name: "mips_interrupt", value: 34, isUnsigned: true)
!525 = !DIEnumerator(name: "riscv64_lp64", value: 35, isUnsigned: true)
!526 = !DIEnumerator(name: "riscv64_lp64_v", value: 36, isUnsigned: true)
!527 = !DIEnumerator(name: "riscv64_interrupt", value: 37, isUnsigned: true)
!528 = !DIEnumerator(name: "riscv32_ilp32", value: 38, isUnsigned: true)
!529 = !DIEnumerator(name: "riscv32_ilp32_v", value: 39, isUnsigned: true)
!530 = !DIEnumerator(name: "riscv32_interrupt", value: 40, isUnsigned: true)
!531 = !DIEnumerator(name: "sparc64_sysv", value: 41, isUnsigned: true)
!532 = !DIEnumerator(name: "sparc_sysv", value: 42, isUnsigned: true)
!533 = !DIEnumerator(name: "powerpc64_elf", value: 43, isUnsigned: true)
!534 = !DIEnumerator(name: "powerpc64_elf_altivec", value: 44, isUnsigned: true)
!535 = !DIEnumerator(name: "powerpc64_elf_v2", value: 45, isUnsigned: true)
!536 = !DIEnumerator(name: "powerpc_sysv", value: 46, isUnsigned: true)
!537 = !DIEnumerator(name: "powerpc_sysv_altivec", value: 47, isUnsigned: true)
!538 = !DIEnumerator(name: "powerpc_aix", value: 48, isUnsigned: true)
!539 = !DIEnumerator(name: "powerpc_aix_altivec", value: 49, isUnsigned: true)
!540 = !DIEnumerator(name: "wasm_watc", value: 50, isUnsigned: true)
!541 = !DIEnumerator(name: "arc_sysv", value: 51, isUnsigned: true)
!542 = !DIEnumerator(name: "avr_gnu", value: 52, isUnsigned: true)
!543 = !DIEnumerator(name: "avr_builtin", value: 53, isUnsigned: true)
!544 = !DIEnumerator(name: "avr_signal", value: 54, isUnsigned: true)
!545 = !DIEnumerator(name: "avr_interrupt", value: 55, isUnsigned: true)
!546 = !DIEnumerator(name: "bpf_std", value: 56, isUnsigned: true)
!547 = !DIEnumerator(name: "csky_sysv", value: 57, isUnsigned: true)
!548 = !DIEnumerator(name: "csky_interrupt", value: 58, isUnsigned: true)
!549 = !DIEnumerator(name: "hexagon_sysv", value: 59, isUnsigned: true)
!550 = !DIEnumerator(name: "hexagon_sysv_hvx", value: 60, isUnsigned: true)
!551 = !DIEnumerator(name: "lanai_sysv", value: 61, isUnsigned: true)
!552 = !DIEnumerator(name: "loongarch64_lp64", value: 62, isUnsigned: true)
!553 = !DIEnumerator(name: "loongarch32_ilp32", value: 63, isUnsigned: true)
!554 = !DIEnumerator(name: "m68k_sysv", value: 64, isUnsigned: true)
!555 = !DIEnumerator(name: "m68k_gnu", value: 65, isUnsigned: true)
!556 = !DIEnumerator(name: "m68k_rtd", value: 66, isUnsigned: true)
!557 = !DIEnumerator(name: "m68k_interrupt", value: 67, isUnsigned: true)
!558 = !DIEnumerator(name: "msp430_eabi", value: 68, isUnsigned: true)
!559 = !DIEnumerator(name: "propeller1_sysv", value: 69, isUnsigned: true)
!560 = !DIEnumerator(name: "propeller2_sysv", value: 70, isUnsigned: true)
!561 = !DIEnumerator(name: "s390x_sysv", value: 71, isUnsigned: true)
!562 = !DIEnumerator(name: "s390x_sysv_vx", value: 72, isUnsigned: true)
!563 = !DIEnumerator(name: "ve_sysv", value: 73, isUnsigned: true)
!564 = !DIEnumerator(name: "xcore_xs1", value: 74, isUnsigned: true)
!565 = !DIEnumerator(name: "xcore_xs2", value: 75, isUnsigned: true)
!566 = !DIEnumerator(name: "xtensa_call0", value: 76, isUnsigned: true)
!567 = !DIEnumerator(name: "xtensa_windowed", value: 77, isUnsigned: true)
!568 = !DIEnumerator(name: "amdgcn_device", value: 78, isUnsigned: true)
!569 = !DIEnumerator(name: "amdgcn_kernel", value: 79, isUnsigned: true)
!570 = !DIEnumerator(name: "amdgcn_cs", value: 80, isUnsigned: true)
!571 = !DIEnumerator(name: "nvptx_device", value: 81, isUnsigned: true)
!572 = !DIEnumerator(name: "nvptx_kernel", value: 82, isUnsigned: true)
!573 = !DIEnumerator(name: "spirv_device", value: 83, isUnsigned: true)
!574 = !DIEnumerator(name: "spirv_kernel", value: 84, isUnsigned: true)
!575 = !DIEnumerator(name: "spirv_fragment", value: 85, isUnsigned: true)
!576 = !DIEnumerator(name: "spirv_vertex", value: 86, isUnsigned: true)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "builtin.OptimizeMode", scope: !118, file: !118, line: 153, baseType: !134, size: 8, align: 8, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIEnumerator(name: "Debug", value: 0, isUnsigned: true)
!580 = !DIEnumerator(name: "ReleaseSafe", value: 1, isUnsigned: true)
!581 = !DIEnumerator(name: "ReleaseFast", value: 2, isUnsigned: true)
!582 = !DIEnumerator(name: "ReleaseSmall", value: 3, isUnsigned: true)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log.Level", scope: !584, file: !584, line: 98, baseType: !134, size: 8, align: 8, elements: !585)
!584 = !DIFile(filename: "log.zig", directory: "/Users/juliaortiz/zig/lib/std")
!585 = !{!586, !587, !588, !589}
!586 = !DIEnumerator(name: "err", value: 0, isUnsigned: true)
!587 = !DIEnumerator(name: "warn", value: 1, isUnsigned: true)
!588 = !DIEnumerator(name: "info", value: 2, isUnsigned: true)
!589 = !DIEnumerator(name: "debug", value: 3, isUnsigned: true)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "crypto.SideChannelsMitigations", scope: !591, file: !591, line: 225, baseType: !134, size: 8, align: 8, elements: !592)
!591 = !DIFile(filename: "crypto.zig", directory: "/Users/juliaortiz/zig/lib/std")
!592 = !{!593, !594, !595, !596}
!593 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!594 = !DIEnumerator(name: "basic", value: 1, isUnsigned: true)
!595 = !DIEnumerator(name: "medium", value: 2, isUnsigned: true)
!596 = !DIEnumerator(name: "full", value: 3, isUnsigned: true)
!597 = !{!598, !601, !605, !607, !609, !611, !614, !616, !618, !620, !622, !624, !633, !642, !0, !644, !646, !648, !651, !653, !655, !669, !671, !674, !677, !679, !681, !683}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "zig_backend", linkageName: "builtin.zig_backend", scope: !600, file: !600, line: 6, type: !117, isLocal: true, isDefinition: true)
!600 = !DIFile(filename: "builtin.zig", directory: "/Users/juliaortiz/.cache/zig/b/fd24905ca4c18ff02a2924d3e2704550")
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "simplified_logic", linkageName: "start.simplified_logic", scope: !603, file: !603, line: 17, type: !604, isLocal: true, isDefinition: true)
!603 = !DIFile(filename: "start.zig", directory: "/Users/juliaortiz/zig/lib/std")
!604 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "output_mode", linkageName: "builtin.output_mode", scope: !600, file: !600, line: 8, type: !133, isLocal: true, isDefinition: true)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "link_libc", linkageName: "builtin.link_libc", scope: !600, file: !600, line: 107, type: !604, isLocal: true, isDefinition: true)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "empty", linkageName: "Target.Cpu.Feature.Set.empty", scope: !140, file: !140, line: 1181, type: !157, isLocal: true, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "apple_a14", linkageName: "Target.aarch64.cpu.apple_a14", scope: !613, file: !613, line: 1781, type: !145, isLocal: true, isDefinition: true)
!613 = !DIFile(filename: "aarch64.zig", directory: "/Users/juliaortiz/zig/lib/std/Target")
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "cpu", linkageName: "builtin.cpu", scope: !600, file: !600, line: 13, type: !141, isLocal: true, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "native_arch", linkageName: "start.native_arch", scope: !603, file: !603, line: 9, type: !139, isLocal: true, isDefinition: true)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "os", linkageName: "builtin.os", scope: !600, file: !600, line: 83, type: !215, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "abi", linkageName: "builtin.abi", scope: !600, file: !600, line: 12, type: !316, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "object_format", linkageName: "builtin.object_format", scope: !600, file: !600, line: 105, type: !348, isLocal: true, isDefinition: true)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "none", linkageName: "Target.DynamicLinker.none", scope: !140, file: !140, line: 2072, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target.DynamicLinker", scope: !4, size: 2048, align: 8, elements: !627)
!627 = !{!628, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !626, baseType: !629, size: 2040, align: 8)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2040, align: 8, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 255, lowerBound: -424)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !626, baseType: !152, size: 8, align: 8, offset: 2040)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "target", linkageName: "builtin.target", scope: !600, file: !600, line: 98, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Target", scope: !4, size: 4032, align: 64, elements: !636)
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !635, baseType: !141, size: 448, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "os", scope: !635, baseType: !215, size: 1472, align: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "abi", scope: !635, baseType: !316, size: 8, align: 8, offset: 1920)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ofmt", scope: !635, baseType: !348, size: 8, align: 8, offset: 1928)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dynamic_linker", scope: !635, baseType: !626, size: 2048, align: 8, offset: 1936)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "c", linkageName: "builtin.CallingConvention.c", scope: !118, file: !118, line: 174, type: !404, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "environ", linkageName: "os.environ", scope: !2, file: !2, line: 47, type: !3, isLocal: true, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "mode", linkageName: "builtin.mode", scope: !600, file: !600, line: 106, type: !577, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "runtime_safety", linkageName: "debug.runtime_safety", scope: !650, file: !650, line: 52, type: !604, isLocal: true, isDefinition: true)
!650 = !DIFile(filename: "debug.zig", directory: "/Users/juliaortiz/zig/lib/std")
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "default_enable_segfault_handler", linkageName: "debug.default_enable_segfault_handler", scope: !650, file: !650, line: 1221, type: !604, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "default_level", linkageName: "log.default_level", scope: !584, file: !584, line: 102, type: !583, isLocal: true, isDefinition: true)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "options", linkageName: "std.options", scope: !657, file: !657, line: 101, type: !658, isLocal: true, isDefinition: true)
!657 = !DIFile(filename: "std.zig", directory: "/Users/juliaortiz/zig/lib/std")
!658 = !DICompositeType(tag: DW_TAG_structure_type, name: "std.Options", scope: !4, size: 128, align: 64, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "fmt_max_depth", scope: !658, baseType: !154, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "enable_segfault_handler", scope: !658, baseType: !604, size: 8, align: 8, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log_level", scope: !658, baseType: !583, size: 8, align: 8, offset: 72)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_always_getrandom", scope: !658, baseType: !604, size: 8, align: 8, offset: 80)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "crypto_fork_safety", scope: !658, baseType: !604, size: 8, align: 8, offset: 88)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "keep_sigpipe", scope: !658, baseType: !604, size: 8, align: 8, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "http_disable_tls", scope: !658, baseType: !604, size: 8, align: 8, offset: 104)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "http_enable_ssl_key_log_file", scope: !658, baseType: !604, size: 8, align: 8, offset: 112)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "side_channels_mitigations", scope: !658, baseType: !590, size: 8, align: 8, offset: 120)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "enable_segfault_handler", linkageName: "debug.enable_segfault_handler", scope: !650, file: !650, line: 1220, type: !604, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "use_libc", linkageName: "posix.use_libc", scope: !673, file: !673, line: 33, type: !604, isLocal: true, isDefinition: true)
!673 = !DIFile(filename: "posix.zig", directory: "/Users/juliaortiz/zig/lib/std")
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "native_os", linkageName: "c.native_os", scope: !676, file: !676, line: 9, type: !245, isLocal: true, isDefinition: true)
!676 = !DIFile(filename: "c.zig", directory: "/Users/juliaortiz/zig/lib/std")
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "C", linkageName: "builtin.CallingConvention.C", scope: !118, file: !118, line: 194, type: !404, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "empty_sigset", linkageName: "c.empty_sigset", scope: !676, file: !676, line: 3946, type: !238, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "empty_sigset", linkageName: "posix.empty_sigset", scope: !673, file: !673, line: 127, type: !238, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "dummy_execute_header", linkageName: "c.dummy_execute_header", scope: !676, file: !676, line: 40, type: !685, isLocal: true, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "macho.mach_header_64", scope: !4, size: 256, align: 32, elements: !686)
!686 = !{!687, !688, !690, !691, !692, !693, !694, !695}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !685, baseType: !238, size: 32, align: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cputype", scope: !685, baseType: !689, size: 32, align: 32, offset: 32)
!689 = !DIBasicType(name: "c_int", size: 32, encoding: DW_ATE_signed)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cpusubtype", scope: !685, baseType: !689, size: 32, align: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "filetype", scope: !685, baseType: !238, size: 32, align: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ncmds", scope: !685, baseType: !238, size: 32, align: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "sizeofcmds", scope: !685, baseType: !238, size: 32, align: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !685, baseType: !238, size: 32, align: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !685, baseType: !238, size: 32, align: 32, offset: 224)
!696 = !{!697, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !3, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[*:0]u8", baseType: !151, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !3, baseType: !154, size: 64, align: 64, offset: 64)
!700 = !{i32 8, !"PIC Level", i32 2}
!701 = !{i32 7, !"PIE Level", i32 2}
!702 = !{i32 2, !"Debug Info Version", i32 3}
!703 = !{i32 7, !"Dwarf Version", i32 4}
!704 = distinct !DISubprogram(name: "main", linkageName: "start.main", scope: !603, file: !603, line: 580, type: !705, scopeLine: 580, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!705 = !DISubroutineType(types: !706)
!706 = !{!689, !689, !707, !710}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*[*:0]c_char", baseType: !708, size: 64, align: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*c_char", baseType: !709, size: 64, align: 8)
!709 = !DIBasicType(name: "c_char", size: 8, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*?[*:0]c_char", baseType: !708, size: 64, align: 64)
!711 = !DILocalVariable(name: "c_argc", arg: 1, scope: !704, file: !603, line: 580, type: !689)
!712 = !DILocation(line: 580, column: 97, scope: !704)
!713 = !DILocalVariable(name: "c_argv", arg: 2, scope: !704, file: !603, line: 580, type: !707)
!714 = !DILocalVariable(name: "c_envp", arg: 3, scope: !704, file: !603, line: 580, type: !710)
!715 = !DILocalVariable(name: "env_count", scope: !704, file: !603, line: 581, type: !154)
!716 = !DILocation(line: 0, scope: !704)
!717 = !DILocation(line: 581, column: 5, scope: !718)
!718 = !DILexicalBlock(scope: !704, file: !603, line: 581, column: 5)
!719 = !DILocation(line: 582, column: 18, scope: !720)
!720 = !DILexicalBlock(scope: !721, file: !603, line: 581, column: 5)
!721 = !DILexicalBlock(scope: !718, file: !603, line: 581, column: 5)
!722 = !DILocation(line: 582, column: 52, scope: !723)
!723 = !DILexicalBlockFile(scope: !724, file: !603, discriminator: 4)
!724 = !DILexicalBlock(scope: !720, file: !603, line: 582, column: 18)
!725 = !DILocalVariable(name: "envp", scope: !704, file: !603, line: 583, type: !3)
!726 = !DILocation(line: 583, column: 51, scope: !704)
!727 = !DILocation(line: 592, column: 40, scope: !704)
!728 = !DILocalVariable(name: "argc", arg: 1, scope: !729, file: !603, line: 592, type: !154)
!729 = !DILexicalBlock(scope: !730, file: !603, line: 592, column: 75)
!730 = distinct !DISubprogram(name: "callMainWithArgs", linkageName: "start.callMainWithArgs", scope: !603, file: !603, line: 570, type: !731, scopeLine: 570, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!731 = !DISubroutineType(types: !732)
!732 = !{!733}
!733 = !DIBasicType(name: "void", encoding: DW_ATE_signed)
!734 = !DILocation(line: 570, scope: !729, inlinedAt: !735)
!735 = !DILocation(line: 592, column: 75, scope: !704)
!736 = !DILocalVariable(name: "argv", arg: 2, scope: !729, file: !603, line: 592, type: !698)
!737 = !DILocalVariable(name: "envp", arg: 3, scope: !729, file: !603, line: 592, type: !3)
!738 = !DILocation(line: 571, column: 23, scope: !729, inlinedAt: !735)
!739 = !DILocation(line: 572, column: 11, scope: !729, inlinedAt: !735)
!740 = !DILocalVariable(name: "have_sigpipe_support", scope: !741, file: !603, line: 673, type: !604)
!741 = distinct !DISubprogram(name: "maybeIgnoreSigpipe", linkageName: "start.maybeIgnoreSigpipe", scope: !603, file: !603, line: 672, type: !731, scopeLine: 672, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!742 = !DILocation(line: 673, column: 42, scope: !741, inlinedAt: !743)
!743 = distinct !DILocation(line: 575, column: 23, scope: !729, inlinedAt: !735)
!744 = !DILocalVariable(name: "act", scope: !745, file: !603, line: 698, type: !746)
!745 = !DILexicalBlock(scope: !741, file: !603, line: 692, column: 9)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "c.Sigaction__struct_2363", scope: !4, size: 128, align: 64, elements: !747)
!747 = !{!748, !755, !756}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !746, baseType: !749, size: 64, align: 64)
!749 = !DICompositeType(tag: DW_TAG_union_type, name: "c.Sigaction__struct_2363__union_2367", scope: !4, size: 64, align: 64, elements: !750)
!750 = !{!751, !754}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !749, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*anyopaque", baseType: !753, size: 64, align: 8)
!753 = !DIBasicType(name: "anyopaque", encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sigaction", scope: !749, baseType: !752, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !746, baseType: !238, size: 32, align: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !746, baseType: !757, size: 32, align: 32, offset: 96)
!757 = !DIBasicType(name: "c_uint", size: 32, encoding: DW_ATE_unsigned)
!758 = !DILocation(line: 698, column: 26, scope: !745, inlinedAt: !743)
!759 = !DILocalVariable(name: "sig", arg: 1, scope: !760, file: !673, line: 5712, type: !165)
!760 = distinct !DISubprogram(name: "sigaction", linkageName: "posix.sigaction", scope: !673, file: !673, line: 5712, type: !761, scopeLine: 5712, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!761 = !DISubroutineType(types: !762)
!762 = !{!733, !165, !763, !763}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*c.Sigaction__struct_2363", baseType: !746, size: 64, align: 64)
!764 = !DILocation(line: 5712, column: 91, scope: !760, inlinedAt: !765)
!765 = distinct !DILocation(line: 701, column: 24, scope: !745, inlinedAt: !743)
!766 = !DILocalVariable(name: "act", arg: 2, scope: !760, file: !673, line: 5712, type: !763)
!767 = !DILocalVariable(name: "oact", arg: 3, scope: !760, file: !673, line: 5712, type: !763)
!768 = !DILocation(line: 5713, column: 35, scope: !760, inlinedAt: !765)
!769 = !DILocalVariable(name: "rc", arg: 1, scope: !770, file: !673, line: 245, type: !689)
!770 = distinct !DISubprogram(name: "errno__anon_2565", linkageName: "posix.errno__anon_2565", scope: !673, file: !673, line: 245, type: !771, scopeLine: 245, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!771 = !DISubroutineType(types: !772)
!772 = !{!7, !689}
!773 = !DILocation(line: 245, column: 29, scope: !770, inlinedAt: !774)
!774 = distinct !DILocation(line: 5713, column: 18, scope: !775, inlinedAt: !765)
!775 = !DILexicalBlockFile(scope: !760, file: !673, discriminator: 2)
!776 = !DILocation(line: 247, column: 20, scope: !777, inlinedAt: !774)
!777 = !DILexicalBlock(scope: !770, file: !673, line: 247, column: 20)
!778 = !DILocation(line: 247, column: 55, scope: !779, inlinedAt: !774)
!779 = !DILexicalBlockFile(scope: !780, file: !673, discriminator: 4)
!780 = !DILexicalBlock(scope: !777, file: !673, line: 247, column: 20)
!781 = !DILocation(line: 247, column: 30, scope: !779, inlinedAt: !774)
!782 = !DILocation(line: 592, column: 5, scope: !783)
!783 = !DILexicalBlockFile(scope: !704, file: !603, discriminator: 2)
!784 = distinct !DISubprogram(name: "noopSigHandler", linkageName: "start.noopSigHandler", scope: !603, file: !603, line: 705, type: !785, scopeLine: 705, flags: DIFlagStaticMember, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!785 = !DISubroutineType(types: !786)
!786 = !{!733, !787}
!787 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
